'''
date: 19/12/29

문자열 형식으로 입력 받은 모스코드(dot: . dash:-)를 해독하여 영어 문장으로 출력하는 프로그램을 작성하시오.

http://codingdojang.com/scode/469?answer=20387#answer_20387
'''

dic_morse = {
   '.-':'A','-...':'B','-.-.':'C','-..':'D','.':'E','..-.':'F',
    '--.':'G','....':'H','..':'I','.---':'J','-.-':'K','.-..':'L',
    '--':'M','-.':'N','---':'O','.--.':'P','--.-':'Q','.-.':'R',
    '...':'S','-':'T','..-':'U','...-':'V','.--':'W','-..-':'X',
    '-.--':'Y','--..':'Z', '':' '
}

def morse(a):
  x = a.split(' ')
  for i in x: print(dic_morse[i], end='')

morse( '.... .  ... .-.. . . .--. ...  . .- .-. .-.. -.--')    # HE SLEEPS EARLY
